mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/uart.c
    uart_obj->irqn = irqn;
    uart_obj->uart = uart_base;
    uart_obj->periph = peripheral;
    uart_obj->regs = ((periph_uart_t*) uart_base);

    // init uart_base
//    HAL_UART_Init(&uart_obj->uart);
    MAP_SysCtlPeripheralEnable(uart_obj->periph);
    while(!MAP_SysCtlPeripheralReady(uart_obj->periph)) {};


    uart_obj->is_enabled = true;
    uart_obj->attached_to_repl = false;

    return true;
}

void uart_attach_to_repl(pyb_uart_obj_t *self, bool attached) {
    self->attached_to_repl = attached;
}

/* obsolete and unused
bool uart_init(pyb_uart_obj_t *uart_obj, uint32_t baudrate) {
    UART_HandleTypeDef *uh = &uart_obj->uart;
    memset(uh, 0, sizeof(*uh));
    uh->Init.BaudRate = baudrate;
    uh->Init.WordLength = UART_WORDLENGTH_8B;
    uh->Init.StopBits = UART_STOPBITS_1;
    uh->Init.Parity = UART_PARITY_NONE;
    uh->Init.Mode = UART_MODE_TX_RX;
    uh->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uh->Init.OverSampling = UART_OVERSAMPLING_16;
    return uart_init2(uart_obj);
}
*/

mp_uint_t uart_rx_any(pyb_uart_obj_t *self) {
    int buffer_bytes = self->read_buf_head - self->read_buf_tail;
    if (buffer_bytes < 0) {
        return buffer_bytes + self->read_buf_len;
    } else if (buffer_bytes > 0) {
        return buffer_bytes;
    } else {
        return !(self->regs->FR & UART_FR_RXFE);
    }
}

// Waits at most timeout milliseconds for at least 1 char to become ready for
// reading (from buf or for direct reading).
// Returns true if something available, false if not.
STATIC bool uart_rx_wait(pyb_uart_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (self->read_buf_tail != self->read_buf_head || (!(self->regs->FR & UART_FR_RXFE))) {
            return true; // have at least 1 char ready for reading
        }
        if (mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

// assumes there is a character available
int uart_rx_char(pyb_uart_obj_t *self) {
    if (self->read_buf_tail != self->read_buf_head) {
        // buffering via IRQ
        int data;
        if (self->char_width == CHAR_WIDTH_9BIT) {
            data = ((uint16_t*)self->read_buf)[self->read_buf_tail];
        } else {
            data = self->read_buf[self->read_buf_tail];
        }
        self->read_buf_tail = (self->read_buf_tail + 1) % self->read_buf_len;
        if (!(self->regs->FR & UART_FR_RXFE)) {
            // UART was stalled by flow ctrl: re-enable IRQ now we have room in buffer
            MAP_UARTIntEnable(self->uart, UART_INT_RX);
        }
        return data;
    } else {
        // no buffering
        // TODO
        uint32_t data = self->regs->DR;
        // if(data & UART_DR_BE) {
            // BREAK ERROR
        // } else if(data & UART_DR_FE){
            // FRAMING ERROR
        // } else if(data & UART_DR_OE){
            // OVERRUN ERROR
        // } else if(data & UART_DR_PE){
            // PARITY ERROR
        // }
        return data & self->char_mask;;
    }
}

// Waits at most timeout milliseconds for TX register to become empty.
// Returns true if can write, false if can't.
STATIC bool uart_tx_wait(pyb_uart_obj_t *self, uint32_t timeout) {
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {

        if (!(self->regs->FR & UART_FR_TXFF)) {
            return true; // tx register is not full
        }
        if (mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

// // Waits at most timeout milliseconds for UART flag to be set.
// // Returns true if flag is/was set, false on timeout.
// STATIC bool uart_wait_flag_set(pyb_uart_obj_t *self, uint32_t flag, uint32_t timeout) {
//     // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
//     // an interrupt and the flag can be set quickly if the baudrate is large.
//     uint32_t start = mp_hal_ticks_cpu();
//     for (;;) {
//         if ((self->regs->FR & flag)) {
//             return true;
//         }
//         if (timeout == 0 || mp_hal_ticks_cpu() - start >= timeout) {
//             return false; // timeout
//         }
//     }
// }

// Waits at most timeout milliseconds for UART flag to be set.
// Returns true if flag is/was set, false on timeout.
STATIC bool uart_wait_flag_unset(pyb_uart_obj_t *self, uint32_t flag, uint32_t timeout) {
    // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
    // an interrupt and the flag can be set quickly if the baudrate is large.
    uint32_t start = mp_hal_ticks_ms();
    for (;;) {
        if (!(self->regs->FR & flag)) {
            return true;
        }
        if (timeout == 0 || mp_hal_ticks_ms() - start >= timeout) {
            return false; // timeout
        }
    }
}

// src - a pointer to the data to send (16-bit aligned for 9-bit chars)
// num_chars - number of characters to send (9-bit chars count for 2 bytes from src)
// *errcode - returns 0 for success, MP_Exxx on error
// returns the number of characters sent (valid even if there was an error)
STATIC size_t uart_tx_data(pyb_uart_obj_t *self, const void *src_in, size_t num_chars, int *errcode) {
    if (num_chars == 0) {
        *errcode = 0;
        return 0;
    }

    uint32_t timeout;
    if (!(self->regs->FR & UART_FR_CTS) && (self->regs->CTL & UART_CTL_CTSEN)) {
        // CTS can hold off transmission for an arbitrarily long time. Apply
        // the overall timeout rather than the character timeout.
        timeout = self->timeout;
    } else {
        // The timeout specified here is for waiting for the TX data register to
        // become empty (ie between chars), as well as for the final char to be
        // completely transferred.  The default value for timeout_char is long
        // enough for 1 char, but we need to double it to wait for the last char
        // to be transferred to the data register, and then to be transmitted.
        timeout = 2 * self->timeout_char;
    }

    const uint8_t *src = (const uint8_t*)src_in;
    size_t num_tx = 0;
    uint32_t data = 0;

    while (num_tx < num_chars) {
        if (!uart_wait_flag_unset(self, UART_FR_TXFF, timeout)) {
            *errcode = MP_ETIMEDOUT;
            return num_tx;
        }
        // if (self->char_width == CHAR_WIDTH_9BIT) {
        //     data = *((uint16_t*)src) & 0x1ff;
        //     src += 2;
        // } else {
            data = *src++;
        // }
        self->regs->DR = 0xFF & data;
        ++num_tx;
    }

    // wait for the UART frame to complete
    if (!uart_wait_flag_unset(self, UART_FR_BUSY, timeout)) {
        *errcode = MP_ETIMEDOUT;
        return num_tx;
    }

