mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/uart.c
    *errcode = 0;
    return num_tx;
}

void uart_tx_strn(pyb_uart_obj_t *uart_obj, const char *str, uint len) {
    int errcode;
    uart_tx_data(uart_obj, str, len, &errcode);
}

// this IRQ handler is set up to handle RXNE interrupts only
void uart_irq_handler(mp_uint_t uart_id) {
    // get the uart object
    pyb_uart_obj_t *self = MP_STATE_PORT(pyb_uart_obj_all)[uart_id - 1];

    if (self == NULL) {
        // UART object has not been set, so we can't do anything, not
        // even disable the IRQ.  This should never happen.
        return;
    }

    if (!(self->regs->FR & UART_FR_RXFE)) {
        if (self->read_buf_len != 0) {
            uint16_t next_head = (self->read_buf_head + 1) % self->read_buf_len;
            if (next_head != self->read_buf_tail) {
                // only read data if room in buf
                int data = self->regs->DR; // clears UART_FLAG_RXNE
                data &= self->char_mask;
                // Handle interrupt coming in on a UART REPL
                // if (self->attached_to_repl && data == mp_interrupt_char) {
                //     // TODO pendsv_kbd_intr();
                //     return;
                // }
                if (self->char_width == CHAR_WIDTH_9BIT) {
                    ((uint16_t*)self->read_buf)[self->read_buf_head] = data;
                } else {
                    self->read_buf[self->read_buf_head] = data;
                }
                self->read_buf_head = next_head;
            } else { // No room: leave char in buf, disable interrupt
                MAP_UARTIntDisable(self->uart, UART_INT_RX);
            }
        }
    }
}

/******************************************************************************/
/* MicroPython bindings                                                       */

STATIC void pyb_uart_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pyb_uart_obj_t *self = self_in;
    if (!self->is_enabled) {
        mp_printf(print, "UART(%u)", self->uart_id);
    } else {
        mp_int_t bits;
        if (self->regs->_9BITADDR & UART_9BITADDR_9BITEN){
            bits = 9;
        } else {
            bits = 5 + ((self->regs->LCRH & UART_LCRH_WLEN_8) >> 5);
        }
        mp_printf(print, "UART(%u, baudrate=%u, bits=%u, parity=",
            self->uart_id, (MAP_SysCtlClockGet() * 4) / ((64 * self->regs->IBRD) + self->regs->IBRD), bits);
        if (!(self->regs->LCRH & UART_LCRH_PEN)) {
            mp_print_str(print, "None");
        } else {
            mp_printf(print, self->regs->LCRH & UART_LCRH_EPS ? "odd" : "even");
        }
        if (self->regs->CTL & (UART_CTL_CTSEN | UART_CTL_RTSEN)) {
            mp_printf(print, ", flow=");
            if (self->regs->CTL & UART_CTL_RTSEN) {
                mp_printf(print, "RTS%s", self->regs->CTL & UART_CTL_CTSEN ? "|" : "");
            }
            if (self->regs->CTL & UART_CTL_CTSEN ) {
                mp_printf(print, "CTS");
            }
        }
        mp_printf(print, ", stop=%u, break=%u, timeout=%u, timeout_char=%u, read_buf_len=%u)",
            self->regs->LCRH & UART_LCRH_STP2 ? 2 : 1,
            self->regs->LCRH & UART_LCRH_BRK,
            self->timeout, self->timeout_char,
            self->read_buf_len == 0 ? 0 : self->read_buf_len - 1); // -1 to adjust for usable length of buffer
    }
}

/// \method init(baudrate, bits=8, parity=None, stop=1, *, timeout=1000, timeout_char=0, flow=0, read_buf_len=64)
///
/// Initialise the UART bus with the given parameters:
///
///   - `baudrate` is the clock rate.
///   - `bits` is the number of bits per byte, 5, 6, 7 or 8.
///   - `parity` is the parity, `None`, 0 (even) or 1 (odd).
///   - `stop` is the number of stop bits, 1 or 2.
///   - `timeout` is the timeout in milliseconds to wait for the first character.
///   - `timeout_char` is the timeout in milliseconds to wait between characters.
///   - `flow` is RTS | CTS where RTS == UART_FLOWCONTROL_RX & CTS == UART_FLOWCONTROL_TX
///   - `read_buf_len` is the character length of the read buffer (0 to disable).
STATIC mp_obj_t pyb_uart_init_helper(pyb_uart_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 9600} },
        { MP_QSTR_bits, MP_ARG_INT, {.u_int = 8} },
        { MP_QSTR_parity, MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_stop, MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_flow, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = UART_FLOWCONTROL_NONE} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 1000} },
        { MP_QSTR_timeout_char, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_read_buf_len, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 64} },
    };

    // parse args
    struct {
        mp_arg_val_t baudrate, bits, parity, stop, flow, timeout, timeout_char, read_buf_len;
    } args;
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, (mp_arg_val_t*)&args);

    // set the UART configuration values
    memset(&self->uart, 0, sizeof(self->uart));


    uint32_t config = 0;

    // parity
    mp_int_t bits = args.bits.u_int;
    if (args.parity.u_obj == mp_const_none) {
        config |= UART_CONFIG_PAR_NONE;
    } else {
        mp_int_t parity = mp_obj_get_int(args.parity.u_obj);
        config |= (parity & 1) ? UART_CONFIG_PAR_ODD : UART_CONFIG_PAR_EVEN;
    }

    // number of bits
    if (bits == 5) {
        config |= UART_CONFIG_WLEN_5;
        self->char_width = CHAR_WIDTH_5BIT;
    } else if ( bits == 6) {
        config |= UART_CONFIG_WLEN_6;
        self->char_width = CHAR_WIDTH_6BIT;
    } else if ( bits == 7) {
        config |= UART_CONFIG_WLEN_7;
        self->char_width = CHAR_WIDTH_7BIT;
    } else if ( bits == 8) {
        config |= UART_CONFIG_WLEN_8;
        self->char_width = CHAR_WIDTH_8BIT;
        // 9Bit not supportet atm
//    } else if ( bits == 9) {
//        config |= UART_CONFIG_WLEN_8;
//        UART9BitEnable(self->uart);
    } else {
        mp_raise_ValueError("unsupported combination of bits and parity");
    }

    self->char_mask = ~(0xFF << self->char_width);

    // stop bits
    switch (args.stop.u_int) {
        case 1: config |= UART_CONFIG_STOP_ONE; break;
        default: config |= UART_CONFIG_STOP_TWO; break;
    }

    //baud rate
    mp_uint_t req_baudrate = args.baudrate.u_int;


